In [3]:
import pandas as pd
df = pd.read_csv("titanic.csv")
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

# Titanic Data

In [4]:
#Doing exploratory analysis and removed not required columns
df.drop(['PassengerId' ,'Name' , 'SibSp' ,'Parch' , 'Ticket' , 'Cabin' ,'Embarked'],axis='columns',inplace= True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [7]:
target =df.Survived
inputs = df.drop('Survived',axis= 'columns')

In [12]:
#Converting sex column into dummies
dummies = pd.get_dummies(inputs.Sex)
dummies.head(3)

   female  male
0       0     1
1       1     0
2       1     0

In [14]:
inputs = pd.concat([inputs,dummies],axis ='columns')
inputs.head(3)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0

In [17]:
inputs.drop('Sex',axis='columns',inplace=True)
inputs.head(3)

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0

In [18]:
#TO check for NaN values
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [22]:
inputs.Age[10:20]

10     4.0
11    58.0
12    20.0
13    39.0
14    14.0
15    55.0
16     2.0
17     NaN
18    31.0
19     NaN
Name: Age, dtype: float64

In [25]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head(5)

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [37]:
# Splitting into train and test data
from sklearn.model_selection import train_test_split
X_train, X_test ,y_train,y_test = train_test_split(inputs,target,test_size =0.2)

In [28]:
len(X_train)

712

In [29]:
len(X_test)

179

In [30]:
len(inputs)

891

In [38]:
#USe gaussian distrivution, when data is not normal(bell curve)
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [39]:
#TO train model
model.fit(X_train, y_train)

GaussianNB()

In [40]:
model.score(X_test,y_test)

0.7877094972067039

In [41]:
X_test[:10]

     Pclass        Age     Fare  female  male
726       2  30.000000  21.0000       1     0
405       2  34.000000  21.0000       0     1
86        3  16.000000  34.3750       0     1
54        1  65.000000  61.9792       0     1
147       3   9.000000  34.3750       1     0
619       2  26.000000  10.5000       0     1
250       3  29.699118   7.2500       0     1
620       3  27.000000  14.4542       0     1
175       3  18.000000   7.8542       0     1
568       3  29.699118   7.2292       0     1

In [43]:
y_test[:10]

726    1
405    0
86     0
54     0
147    0
619    0
250    0
620    0
175    0
568    0
Name: Survived, dtype: int64

In [44]:
model.predict(X_test[:10])

array([1, 0, 0, 0, 1, 0, 0, 0, 0, 0], dtype=int64)

In [45]:
model.predict_proba(X_test[:10])

array([[0.02281647, 0.97718353],
       [0.97860556, 0.02139444],
       [0.98423076, 0.01576924],
       [0.84867085, 0.15132915],
       [0.02678983, 0.97321017],
       [0.97682746, 0.02317254],
       [0.98892791, 0.01107209],
       [0.98874816, 0.01125184],
       [0.98661957, 0.01338043],
       [0.98892676, 0.01107324]])

# Email spam detection

In [47]:
import pandas as pd
df =pd.read_csv('spam.csv')
df.head()

  Category                                            Message
0      ham  Go until jurong point, crazy.. Available only ...
1      ham                      Ok lar... Joking wif u oni...
2     spam  Free entry in 2 a wkly comp to win FA Cup fina...
3      ham  U dun say so early hor... U c already then say...
4      ham  Nah I don't think he goes to usf, he lives aro...

In [48]:
df.groupby('Category').describe()

         Message                                                            \
           count unique                                                top
Category
ham         4825   4516                             Sorry, I'll call later
spam         747    641  Please call our customer service representativ...


         freq
Category
ham        30
spam        4

In [50]:
#Converting into numbers
df['spam'] =df['Category'].apply(lambda x : 1 if x=='spam' else 0)
df.head()

  Category                                            Message  spam
0      ham  Go until jurong point, crazy.. Available only ...     0
1      ham                      Ok lar... Joking wif u oni...     0
2     spam  Free entry in 2 a wkly comp to win FA Cup fina...     1
3      ham  U dun say so early hor... U c already then say...     0
4      ham  Nah I don't think he goes to usf, he lives aro...     0

In [52]:
# train test split
from sklearn.model_selection  import train_test_split
X_train, X_test ,y_train ,y_test = train_test_split(df.Message, df.spam,test_size= 0.25)

In [58]:
#Dealing with message column because it is in text format
# For this we will be using CountVectorizer
from sklearn.feature_extraction.text import CountVectorizer
v = CountVectorizer()
X_train_count  = v.fit_transform(X_train.values)
X_train_count.toarray()[:3]

array([[0, 0, 0, ..., 0, 0, 0],
       [0, 0, 0, ..., 0, 0, 0],
       [0, 0, 0, ..., 0, 0, 0]], dtype=int64)

In [59]:
from sklearn.naive_bayes import MultinomialNB
model  = MultinomialNB()
model.fit(X_train_count,y_train)

MultinomialNB()

In [64]:
emails= [
    'How are u ?'
    'Please refresh data and reach out to us'
]
emails_count  = v.transform(emails)
model.predict(emails_count)

array([0], dtype=int64)

In [65]:
X_test_count  = v.transform(X_test)
model.score(X_test_count,y_test)

0.9892318736539842

In [66]:
from sklearn.pipeline import Pipeline
clf = Pipeline([
    ('vectorizer', CountVectorizer()),
    ('nb' , MultinomialNB())
])

In [67]:
clf.fit(X_train,y_train)

Pipeline(steps=[('vectorizer', CountVectorizer()), ('nb', MultinomialNB())])

In [69]:
clf.score(X_test,y_test)

0.9892318736539842

In [70]:
clf.predict(emails)

array([0], dtype=int64)